app/views/co_ops/index.html.slim

                td= co_op.location
                td= co_op.users.count
---
SELECT COUNT(*) FROM `users` WHERE `users`.`co_op_id` = 1