app/views/co_ops/show.html.slim

SELECT `users`.* FROM `users` WHERE `users`.`co_op_id` = 1
---
    dt Users
    - @co_op.users.each do |user|