app/controllers/co_ops_controller.rb

  def index
    @co_ops = CoOp.all
---
SELECT `co_ops`.* FROM `co_ops`

  def show
    @co_op = CoOp.find(params[:id])
---
SELECT  `co_ops`.* FROM `co_ops` WHERE `co_ops`.`id` = 1 LIMIT 1